# MNIST

###  Importing Libraries

In [64]:
import pandas as pd 
import numpy as np

In [65]:
import matplotlib.pyplot as plt
from matplotlib import image
from tqdm import tqdm
from PIL import Image

### Loading Images using matplotlib

In [67]:
img = image.imread("mnist_data/1/img_0.png")
img = img[:,:,2]

In [68]:
f_img = img.flatten()

In [69]:
img_arr = np.array(f_img)

In [62]:
len(img_arr)

784

###  Loading Images using PIL

In [73]:
img = Image.open('mnist_data/7/img_0.png')
gray_image = img.convert("L")

img_np = np.array(gray_image)

print(type(img_np), img_np.shape)
img_arr = img_np.ravel()

<class 'numpy.ndarray'> (28, 28)

In [74]:
len(img_np.ravel())

784

In [75]:
img_arr

array([ 30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  89, 123,  85,  74,  74,  52,
        67,  74,  74,  74,  74, 104, 158, 123,  60,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30, 107, 213, 212, 213,
       212, 185, 203, 213, 212, 213, 212, 213, 212, 194,  60,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30, 108,  99,
        67,  99,  99,  99,  99,  99,  99,  99, 130, 214, 213, 117,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
       167,  99,  30,  30,  30,  30,  30,  30,  30,  30, 149, 213, 176,
        51,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30, 167, 117,  30,  30,  30,  30,  30,  30,  30,  42, 176,
       214,  94,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  67, 203,  99,  30,  30,  30,  30,  30,  30,  30,
        74, 212, 139,  41,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  67, 185,  99,  30,  30,  30,  30,  30,
        30,  30, 177, 213,  99,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  51,  51,  30,  30,  30,
        30,  30,  30,  30, 213, 212,  99,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  80, 214, 213,  67,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  99, 213, 138,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30, 131, 214,  94,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30, 167, 213,
        73,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  74,
       213, 214,  73,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  74, 212, 213,  73,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  74, 213, 214,  73,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  74, 212, 176,  41,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30, 123, 213,  89,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30, 194, 212,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  52, 215, 213,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  51,
       213, 176,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,  30,
        30,  30,  30,  30], dtype=uint8)

### we use PIL to create DataFrame

### Creating A DataFrame

In [31]:
df= pd.DataFrame(columns=(np.arange(0,785)))
df1= pd.DataFrame(columns=(np.arange(0,785)))
df2= pd.DataFrame(columns=(np.arange(0,785)))
df3= pd.DataFrame(columns=(np.arange(0,785)))
df4= pd.DataFrame(columns=(np.arange(0,785)))
df5= pd.DataFrame(columns=(np.arange(0,785)))
df6= pd.DataFrame(columns=(np.arange(0,785)))
df7= pd.DataFrame(columns=(np.arange(0,785)))
df8= pd.DataFrame(columns=(np.arange(0,785)))
df9= pd.DataFrame(columns=(np.arange(0,785)))

for i in tqdm(range(10)):
    if i == 0:
        for j in range(4132):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df = df.append(pd.DataFrame(img_arr).T,ignore_index=True)
        
    elif i == 1:
        for j in range(4684):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df1 = df1.append(pd.DataFrame(img_arr).T,ignore_index=True)
    
    elif i == 2:
        for j in range(4177):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df2 = df2.append(pd.DataFrame(img_arr).T,ignore_index=True)
            
    elif i == 3:
        for j in range(4351):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df3 = df3.append(pd.DataFrame(img_arr).T,ignore_index=True)
        
    elif i == 4:
        for j in range(4072):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df4 = df4.append(pd.DataFrame(img_arr).T,ignore_index=True)
    
    elif i == 5:
        for j in range(3795):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df5 = df5.append(pd.DataFrame(img_arr).T,ignore_index=True)
            
    elif i == 6:
        for j in range(4137):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df6 = df6.append(pd.DataFrame(img_arr).T,ignore_index=True)
        
    elif i == 7:
        for j in range(4401):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df7 = df7.append(pd.DataFrame(img_arr).T,ignore_index=True)
        
    elif i == 8:
        for j in range(4063):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df8 = df8.append(pd.DataFrame(img_arr).T,ignore_index=True)       

    elif i == 9:
        for j in range(4188):
            img = Image.open(f"mnist_data/{i}/img_{j}.png")
            gray_image = img.convert("L")
            img_np = np.array(gray_image)
            img_arr = img_np.ravel()
            df9 = df9.append(pd.DataFrame(img_arr).T,ignore_index=True)   
    else:
        pass
    
    
    
df[784] = 0
df1[784] = 1
df2[784] = 2
df3[784] = 3
df4[784] = 4
df5[784] = 5
df6[784] = 6
df7[784] = 7
df8[784] = 8
df9[784] = 9

100%|██████████████████████████████████████████████████████████████████████████████████| 10/10 [11:46<00:00, 70.66s/it]

### checking DataFrames

In [32]:
df.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,0

In [33]:
df1.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,1

In [34]:
df2.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,2

In [35]:
df3.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,3

In [36]:
df4.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,4

In [37]:
df5.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,5

In [38]:
df6.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,6

In [39]:
df7.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,7

In [40]:
df8.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,8

In [41]:
df9.head(1)

,0,1,2,3,4,5,6,7,8,9,...,775,776,777,778,779,780,781,782,783,784
0,30,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,9

###

### Cross checking DataFrames with correct images

### Concatinating All DataFrames

In [54]:
data = pd.concat([df,df1,df2,df3,df4,df5,df6,df7,df8,df9])

In [55]:
data.reset_index()

,index,0,1,2,3,4,5,6,7,8,...,775,776,777,778,779,780,781,782,783,784
0,0,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,0
1,1,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,0
2,2,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,0
3,3,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,0
4,4,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41995,4183,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,9
41996,4184,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,9
41997,4185,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,9
41998,4186,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,9
41999,4187,30,30,30,30,30,30,30,30,30,...,30,30,30,30,30,30,30,30,30,9

In [56]:
#data.to_csv("MNIST1.csv")

### Will Continue this  Project in 2.0

#### All the image files are used to create this  DataFrame is More size so i uploaded all in Zip file  of below link

https://drive.google.com/file/d/1eRZ2dbTnC354IyFK4tj5_6y5MNNUX1Hp/view?usp=sharing